meili = ['姹', '娇', '娟', '丽', '翎', '美', '绮', '倩', '鸲', '妍', '玉', '雉']  #美丽
piaoliang = ['艾', '靓', '帅']  #漂亮
meiyu = ['瑷', '璨', '瑾', '琳', '璐', '琦', '琪', '琼', '琬', '璇', '瑶', '瑛', '瑜']  #美玉
meihao = [
    '艾', '粲', '芳', '丰', '徽', '嘉', '佼', '令', '媚', '琦', '劭', '姝', '淑', '婉', '嫣',
    '懿', '优', '臻'
]  #美好
gaoda = ['岸', '彪', '殿', '峻', '伉', '闶', '魁', '蓼', '岭', '巍', '嵬', '仡', '俣',
         '岳']  #高大
congming = ['慧', '神', '黠', '颖', '智']  #聪明
nenggan = ['干', '行']  #能干
jiankang = ['好', '康', '养']  #健康
qinlao = ['劬']  #勤劳
yangguang = ['光', '晖', '晒', '旭']  #阳光
zhongcheng = ['赤', '忠']  #忠诚
shanliang = ['良', '善', '淑', '驯']  #善良
jianqiang = ['刚', '劲', '强', '铁']  #坚强
youmei = ['辞', '胜']  #优美
zhihui = ['哲', '智']  #智慧
keai = ['娇', '可', '媚']  #可爱
kuaile = ['忭', '欢', '恺', '乐', '陶', '喜', '怡', '娱', '豫']  #快乐
fengfu = ['博', '丰', '富', '茂', '饶', '赡', '洋', '殷', '裕']  #丰富
guang = [
    '白', '炳', '孛', '铂', '钚', '辰', '裎', '赤', '磋', '单', '挡', '荡', '灯', '碘', '电',
    '锇', '蒽', '铒', '菲', '感', '锆', '耿', '光', '硅', '鬼', '晷', '炅', '颢', '黑', '弘',
    '虹', '华', '滑', '焕', '晃', '晖', '辉', '火', '晶', '镜', '开', '朗', '铑', '镭', '锂',
    '笠', '亮', '溜', '麻', '猫', '镅', '镁', '锰', '蠓', '明', '磨', '氖', '霓', '硼', '篷',
    '钷', '镤', '槭', '漆', '荣', '铷', '润', '铯', '晒', '射', '晟', '鲥', '铊', '桃', '锑',
    '透', '炜', '硒', '熙', '熹', '洗', '霞', '氙', '跣', '星', '旭', '炫', '雪', '曛', '砑',
    '氩', '艳', '阳', '鳐', '曜', '耀', '晔', '烨', '熠', '阴', '荫', '铟', '瑛', '荧', '莹',
    '萤', '映', '瑜', '玉', '昱', '昀', '晕', '泽', '锃', '照', '锗', '铮', '支', '雉', '槠',
    '烛', '着'
]  #光
ri = [
    '暧', '白', '表', '朝', '辰', '大', '诞', '个', '工', '晷', '号', '和', '黑', '虹', '黄',
    '节', '历', '轮', '暝', '年', '臬', '篷', '期', '庆', '日', '社', '食', '望', '惟', '倭',
    '午', '昔', '霞', '下', '曛', '旬', '阳', '曜', '夜', '烨', '银', '昱', '昀', '晕', '止'
] #日
yue = [
    '挨', '辰', '底', '分', '份', '光', '桂', '号', '华', '浣', '鳇', '晦', '戟', '季', '经',
    '腊', '厘', '历', '轮', '孟', '杪', '闰', '食', '望', '惟', '星', '血', '旬', '曜', '阴',
    '月', '晕', '正', '止', '仲'
] #月
guangming = ['炳', '耿', '炅', '焕', '明', '晟', '炜', '熙', '熹', '阴']  #光明
pingan = ['安', '靖', '泰', '夷']  #平安
hao = [
    '蔼', '艾', '安', '疤', '摆', '瘢', '棒', '包', '贬', '铂', '才', '粲', '差', '馋', '长',
    '丑', '答', '叨', '得', '锝', '鸫', '恶', '犯', '范', '芳', '丰', '氟', '该', '甘', '感',
    '刚', '媾', '桄', '好', '候', '坏', '还', '徽', '惠', '骥', '佳', '嘉', '佼', '经', '精',
    '靓', '掬', '俊', '骏', '锴', '看', '可', '赖', '嘞', '丽', '良', '咧', '劣', '令', '鎏',
    '陋', '鹛', '美', '媚', '迷', '密', '妙', '明', '抹', '难', '孬', '闹', '铌', '癖', '品',
    '破', '琦', '砌', '歉', '强', '巧', '俏', '亲', '卿', '秋', '雀', '瓤', '让', '惹', '润',
    '若', '散', '善', '劭', '生', '适', '嗜', '姝', '淑', '数', '套', '婉', '望', '喜', '香',
    '象', '骁', '谐', '新', '羞', '馐', '畜', '嫣', '艳', '益', '懿', '硬', '优', '友', '与',
    '愈', '晕', '韵', '沾', '招', '辙', '臻', '正', '中', '祝', '转', '醉'
]  #好
fei = [
    '翱', '鸨', '舱', '翅', '舵', '鹗', '飞', '蜚', '锆', '机', '鸡', '锔', '开', '龙', '鹭',
    '铝', '镁', '鸟', '蓬', '铍', '翩', '飘', '驶', '谥', '舷', '翔', '啸', '雁', '燕', '翼',
    '萤', '只', '雉', '翥'
]  #飞
jiechu = ['豪', '杰', '挺', '英']  #杰出
qin = [
    '白', '北', '跸', '标', '策', '铲', '澈', '酲', '澄', '脆', '荡', '道', '梵', '府', '酤',
    '泓', '昏', '洁', '净', '俊', '朗', '亮', '洌', '泠', '浏', '渌', '盲', '茫', '迷', '明',
    '摸', '盘', '泮', '清', '沙', '疏', '熟', '刷', '爽', '晰', '洗', '详', '潇', '啸', '醒',
    '秀', '哑', '莺', '滢', '勇', '湛', '真', '浊', '醉'
]  #清

xing = []
imageryDic = {}
